Output from v2.4.0

```
:~/projects/public_ip_test$ terraform apply
azurerm_resource_group.test: Refreshing state... [id=/subscriptions/REDACTED/resourceGroups/acctestRG]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.test will be created
  + resource "azurerm_public_ip" "test" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus"
      + name                    = "acctestpublicip"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "acctestRG"
      + sku                     = "Standard"
      + tags                    = {
          + "cost_center" = "MSFT"
          + "environment" = "Production"
        }
    }

  # azurerm_public_ip_prefix.test will be created
  + resource "azurerm_public_ip_prefix" "test" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + location            = "westus"
      + name                = "acctestpublicipprefix"
      + prefix_length       = 28
      + resource_group_name = "acctestRG"
      + sku                 = "Standard"
    }

  # azurerm_resource_group.test will be created
  + resource "azurerm_resource_group" "test" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "acctestRG"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


Warning: Interpolation-only expressions are deprecated

  on main.tf line 8, in resource "azurerm_public_ip_prefix" "test":
   8:   location            = "${azurerm_resource_group.test.location}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 4 more similar warnings elsewhere)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_resource_group.test: Creating...
azurerm_resource_group.test: Creation complete after 3s [id=/subscriptions/REDACTED/resourceGroups/acctestRG]
azurerm_public_ip_prefix.test: Creating...
azurerm_public_ip_prefix.test: Still creating... [10s elapsed]
zazurerm_public_ip_prefix.test: Still creating... [20s elapsed]
azurerm_public_ip_prefix.test: Creation complete after 25s [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPPrefixes/acctestpublicipprefix]
azurerm_public_ip.test: Creating...
azurerm_public_ip.test: Creation complete after 5s [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPAddresses/acctestpublicip]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
:~/projects/public_ip_test$ mv main.tf  main.old-tf
:~/projects/public_ip_test$ cat > main.tf
resource "azurerm_resource_group" "test" {
  name     = "acctestRG"
  location = "westus"
}

resource "azurerm_public_ip" "test" {
  name                = "acctestpublicip"
  location            = "${azurerm_resource_group.test.location}"
  resource_group_name = "${azurerm_resource_group.test.name}"
  allocation_method   = "Static"
  sku                 = "Standard"

  tags = {
    environment = "Production"
    cost_center = "MSFT"
  }
}
:~/projects/public_ip_test$ terraform apply
azurerm_resource_group.test: Refreshing state... [id=/subscriptions/REDACTED/resourceGroups/acctestRG]
azurerm_public_ip_prefix.test: Refreshing state... [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPPrefixes/acctestpublicipprefix]
azurerm_public_ip.test: Refreshing state... [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPAddresses/acctestpublicip]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_public_ip.test must be replaced
-/+ resource "azurerm_public_ip" "test" {
        allocation_method       = "Static"
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPAddresses/acctestpublicip" -> (known after apply)
        idle_timeout_in_minutes = 4
      ~ ip_address              = "13.88.142.128" -> (known after apply)
        ip_version              = "IPv4"
        location                = "westus"
        name                    = "acctestpublicip"
      - public_ip_prefix_id     = "/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPPrefixes/acctestpublicipprefix" -> null # forces replacement
        resource_group_name     = "acctestRG"
        sku                     = "Standard"
        tags                    = {
            "cost_center" = "MSFT"
            "environment" = "Production"
        }
      - zones                   = [] -> null
    }

  # azurerm_public_ip_prefix.test will be destroyed
  - resource "azurerm_public_ip_prefix" "test" {
      - id                  = "/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPPrefixes/acctestpublicipprefix" -> null
      - ip_prefix           = "13.88.142.128/28" -> null
      - location            = "westus" -> null
      - name                = "acctestpublicipprefix" -> null
      - prefix_length       = 28 -> null
      - resource_group_name = "acctestRG" -> null
      - sku                 = "Standard" -> null
      - tags                = {} -> null
      - zones               = [] -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.


Warning: Interpolation-only expressions are deprecated

  on main.tf line 8, in resource "azurerm_public_ip" "test":
   8:   location            = "${azurerm_resource_group.test.location}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and one more similar warning elsewhere)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_public_ip.test: Destroying... [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPAddresses/acctestpublicip]
azurerm_public_ip.test: Still destroying... [id=/subscriptions/REDACTED...work/publicIPAddresses/acctestpublicip, 10s elapsed]
azurerm_public_ip.test: Destruction complete after 13s
azurerm_public_ip_prefix.test: Destroying... [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPPrefixes/acctestpublicipprefix]
azurerm_public_ip_prefix.test: Still destroying... [id=/subscriptions/REDACTED...publicIPPrefixes/acctestpublicipprefix, 10s elapsed]
azurerm_public_ip_prefix.test: Destruction complete after 11s
azurerm_public_ip.test: Creating...
azurerm_public_ip.test: Creation complete after 5s [id=/subscriptions/REDACTED/resourceGroups/acctestRG/providers/Microsoft.Network/publicIPAddresses/acctestpublicip]

```